InformationRegisters/ЗадачиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадачСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадачСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СостоянияЗадачСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗадачиСотрудников/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьЗадачуНаСервере()
	// Перевести текущую задачу в статус "Выполнено"
	МенеджерЗаписи = РегистрыСведений.ЗадачиСотрудников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Время = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ЭтаФорма.СотрудникНаКлиенте;
	МенеджерЗаписи.ТипЗадачи = ЭтаФорма.ТипЗадачиНаКлиенте;
	МенеджерЗаписи.Состояние = Перечисления.СостоянияЗадачСотрудников.Выполнена;
	МенеджерЗаписи.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	// Передать текущие значения на сервер
	ЭтаФорма.СотрудникНаКлиенте = ЭтаФорма.Элементы.Список.ТекущиеДанные.Сотрудник;
	ЭтаФорма.ТипЗадачиНаКлиенте = ЭтаФорма.Элементы.Список.ТекущиеДанные.ТипЗадачи;
	ВыполнитьЗадачуНаСервере();
	// Убрать звездочку
	ЭтаФорма.Модифицированность = Ложь;
	ПоказатьОповещениеПользователя(ЭтаФорма.ТипЗадачиНаКлиенте,,"Задача выполнена",БиблиотекаКартинок.NC_МероприятиеВыполнено);
	ЭтаФорма.Элементы.Список.Обновить();
КонецПроцедуры
